Self intersecting splines are not allowed in sketches.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId SelfIntersectingSpline { get; }
  Visual Basic
Public Shared ReadOnly Property SelfIntersectingSpline As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ SelfIntersectingSpline {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures CurveFailures Class
  Autodesk.Revit.DB Namespace